# RoutingCondition Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingCondition Class
Members See Also
---
RoutingCondition represents routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RoutingCondition : IDisposable
```

Visual Basic
---
```text
Public Class RoutingCondition _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RoutingCondition : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RoutingCondition
# See Also
RoutingCondition Members
Autodesk.Revit.DB Namespace